# #1. a.pop() -> [4,5,6,[7,8,9]
# a= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# a.pop(1)
# a.pop(0)
# a.pop(0)
# a.pop(1)
# a.pop(1)
# a.pop(1)
# print(a)

# #2. [1,2,3,[4,5,6,[7,8,9]],10,11,12]을 역순으로 뒤집기 
# b= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# # b=b[::-1]
# b=list(reversed(b))
# print(b)

# #3. 인덱싱[1,2,3,[4,5,6,[9,8,7]],10,11,12]
# c= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# # c[3][3][0]=9
# # c[3][3][1]=8
# # c[3][3][2]=7
# c[3][3]=[9,8,7]
# print(c)

# #4. 10,11,12 지우는데 함수를 써야함
# d= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# d.remove(10)
# d.remove(11)
# d.remove(12)
# print(d)

# #5. 10을 추가(함수) 해서 10의 갯수를 가져와야함.(2개)
# e= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# e.append(10)
# abc=e.count(10)
# print(e,abc)

# #6. insert 함수를 사용해서 
# # x= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# # [1,2,[1,2,3],3,[4,5,6,[7,8,9]],10,11,12]
# x= [1,2,3,[4,5,6,[7,8,9]],10,11,12]
# x.insert(2,[1,2,3])
# print(x)

# s=set()
# s.add(1)
# s.add(2)
# s.add(3)
# print(s) #{1,2,3}

#<<set>>

a = [1,2,3,4,5,6,7,8,9,10]
a=list(reversed(a))
print(a)
a=set(a)
print(a)


l= [1,2,3,4,5,6,7,8,9,10]
a = set(l)
s = [11,12,13]
a.update(s)
print(a)

a.remove(1)
print(a)

s = set([1,2,3,6,7,8])
f = set([1,2,3,4,5])
print(s&f)
print(s.intersection(f))
print(s|f)
print(s.union(f))
print(s-f)
print(f-s)
print(s.difference(f))


